app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("updated_at", "crypted_password", "fullname", "password_salt", "persistence_token", "login_count", "birth", "email", "created_at") VALUES('2009-10-04 11:36:05', '99f72f93492dfaf9b0d326d9e0fbdada14b4007b3098604677e45fbf51d0d491c3ea08e6b7eee9b4ad3eda504102e0e8b2b850eed628e5a5058d399d8820de2b', 'Yossapas', 'kRmrtqA8WelPL1p00DEN', '8f240fc5e8423abc98548de026f57e857a84d8864106e90fef659bbdf74c00b5c2d804566fc1edd930abe6dddf3a3327ed250a2fbd5203f7a7d6c48adb76cf05', 0, '2009-10-04 11:35:00', 'art_wv@hotmail.com', '2009-10-04 11:36:05')

  def update
    @user = current_user
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "login_count" = 6, "persistence_token" = '11255e6acac8cb72a9190c1d71beeafa16284cf5f8d76897c0f0082b555333a44f2c57aaaa459099d0def56462397aa5071c36c314fb5d2521f13592bf582d98', "crypted_password" = 'a92a0e2fc0a6af133e6d8129da7346476dff9c424e98cf60cea54e949ffbc76028cd894989dddfa5319bc78c00ac9dbac5378c59a3db3a075a21479c9ea0843b', "updated_at" = '2009-10-04 12:34:28', "password_salt" = 'GLZsdtmCgyT0PEGoSkAs' WHERE "id" = 2